/*learn JS once again*/

// все сущности в js является объектом
// Объект -- пара: значение

// Вложенный объект -- это объект в объекте

// Массив - объект и функция тоже. Числа и строки ведут себя как объекты.

// console.log("Hello world");
// console - объкт. log - метод(функция). "." - точечная запись(доступ к методу объекту.). () -- скобки, жто вызов метода. То, что находится в скобках - это аргумент.

// console.log("hello world");

// Вырадения, функции, объекты.

// // Любое выражение возвращает значение
// 'abc'
// 10
// 5+2
// c = 100

// > c =10
// 10
// > c
// 10
// > 10
// 10
// > c + 2
// 12
// > "lol " + "lol"
// 'lol lol'
// > a == 12 || b !== 3
// Uncaught ReferenceError: a is not defined
// > a = 12
// 12
// > b = 13
// 13
// > a <= 14 || b !== 2
// true
// > a < b && a > 2
// true

// переменной можно присваивать объекты

// Выражения с побочными действиями - side efects. Это выражения, которые не только возвращают значения, но и выполняют другие действия

// a = 5;
// a++;
// a++;
// console.log(a);

/*Переменные*/

// Переменные - это ребята, которые дают повторный доступ к значениям. В переменной сохраняется значение. Перменная - это как коробка, в которой что - то есть.

/*Имена переменных*/
